#+title: Simple pairing heap benchmarks
#+options: num:nil toc:2 ^:nil

* Benchmark code                                                   :noexport:

The following two code blocks must be evaluated before evaluating the
benchmark blocks (using ~C-c C-c~).

#+caption: Setup code
#+begin_src lisp :results silent
  (eval-when (:load-toplevel :compile-toplevel :execute)
    (unless (find-package '#:alexandria)
      (ql:quickload "alexandria"))
    (unless (find-package '#:simple-pairing-heap)
      (ql:quickload "simple-pairing-heap"))
    (unless (find-package '#:bodge-heap)
      (ql:quickload "bodge-heap"))
    (unless (find-package '#:damn-fast-priority-queue)
      (ql:quickload "damn-fast-priority-queue")))
#+end_src

#+caption: Benchmark code
#+begin_src lisp :results silent
  (defun benchmark (&key (n 1000)
                         (m 1000)
                         (repeat 50)
                         (warmup 3)
                         (key #'identity)
                         (node-constructor #'identity))
    ;; Damn fast priority queue only supports (UNSIGNED-BYTE 32) keys.
    (assert (< (+ n m) (expt 2 32))
            (n m)
            "Too many items (~D + ~D = ~D)."
            n m (+ n m))
    (let* ((items (alexandria:shuffle
                   (mapcar node-constructor (alexandria:iota (+ n m)))))
           (init-items (subseq items 0 n))
           (more-items (nthcdr n items)))
      (macrolet ((bench ((heap-var item-var description)
                         new add del)
                   `(progn
                      (write-line ,description *trace-output*)
                      ,#+sbcl (sb-ext:gc :full t)
                      (flet ((run ()
                               (let ((,heap-var ,new))
                                 (loop for ,item-var in init-items
                                       do ,add)
                                 (loop for ,item-var in more-items
                                       do ,del ,add))))
                        (loop repeat warmup do (run))
                        (time
                         (loop repeat repeat do (run)))
                        (finish-output *trace-output*)))))
        (format *trace-output*
                "~&Heap of size ~D, with ~D reinserts (×~D), on ~A ~A~2%"
                n m repeat
                (lisp-implementation-type) (lisp-implementation-version))
        (bench (heap item "SIMPLE-PAIRING-HEAP (recursive)")
               (simple-pairing-heap:create :recursive-merge t)
               (simple-pairing-heap:insert item heap (funcall key item))
               (simple-pairing-heap:pop-front heap))
        (bench (heap item "SIMPLE-PAIRING-HEAP (consing)")
               (simple-pairing-heap:create)
               (simple-pairing-heap:insert item heap (funcall key item))
               (simple-pairing-heap:pop-front heap))
        (bench (heap item "BODGE-HEAP (pairing)")
               (bodge-heap:make-pairing-heap :key key)
               (bodge-heap:pairing-heap-push heap item)
               (bodge-heap:pairing-heap-pop heap))
        (bench (heap item "DAMN-FAST-PRIORITY-QUEUE")
               (damn-fast-priority-queue:make-queue)
               (damn-fast-priority-queue:enqueue heap item (funcall key item))
               (damn-fast-priority-queue:dequeue heap))
        t)))
#+end_src

#+caption: Sampling code
#+name: run-benchmark
#+begin_src lisp :var heap-size=1000 reinserts=1000 repeats=50
  (let ((output (with-output-to-string (*trace-output*)
                  (benchmark :n heap-size
                             :m reinserts
                             :repeat repeats
                             :node-constructor (lambda (n) (cons n n))
                             :key #'car))))
    (string-right-trim '(#\space #\return #\newline) output))
#+end_src

Including ~*features*~ just for the record:

#+caption: Features
#+name: cl-features
#+begin_src lisp :results output
  (let ((*print-length* nil))
    (dolist (sym (sort (copy-list *features*) #'string<))
      (prin1 sym)
      (terpri)))
#+end_src

#+RESULTS: cl-features
#+begin_example
:64-BIT
:ANSI-CL
:ARENA-ALLOCATOR
:ASDF
:ASDF-UNICODE
:ASDF2
:ASDF3
:ASDF3.1
:ASDF3.2
:ASDF3.3
:COMMON-LISP
:ELF
:GENCGC
:HUNCHENTOOT-NO-SSL
:IEEE-FLOATING-POINT
:LINUX
:LITTLE-ENDIAN
:MCCLIM-FFI-FREETYPE
:NON-BASE-CHARS-EXIST-P
:OS-UNIX
:PACKAGE-LOCAL-NICKNAMES
:QUICKLISP
:SB-CORE-COMPRESSION
:SB-LDB
:SB-PACKAGE-LOCKS
:SB-THREAD
:SB-UNICODE
:SBCL
ALEXANDRIA::SEQUENCE-EMPTYP
:SWANK
:UNIX
:X86-64
#+end_example

